{"config": {"name": "sequential_1", "layers": [{"class_name": "CuDNNLSTM", "config": {"bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "unit_forget_bias": true, "return_state": false, "units": 100, "return_sequences": true, "kernel_constraint": null, "stateful": true, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "name": "cu_dnnlstm_1", "go_backwards": false, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "batch_input_shape": [8, 50, 1], "recurrent_regularizer": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 1, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, "trainable": true}}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}