{"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "CuDNNGRU", "config": {"dtype": "float32", "go_backwards": false, "bias_regularizer": null, "stateful": true, "batch_input_shape": [8, 50, 40], "bias_constraint": null, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "return_state": false, "return_sequences": true, "name": "cu_dnngru_6", "units": 70, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "seed": null, "rate": 0.1, "trainable": true, "noise_shape": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_4", "trainable": true, "layer": {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 40, "name": "dense_4", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true}}}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}