{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "use_bias": true, "dtype": "float32", "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 100, "trainable": true, "batch_input_shape": [null, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_1"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 100, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_2"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 1, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}, "backend": "tensorflow"}